ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/datalog.c
/**
 * @file    datalog.c
 * @brief   Append-only kruhovy log stability mereni. Viz datalog.h.
 *
 * ── Rozvrzeni na ulozisti ──────────────────────────────────────────────────
 * Region = pole zaznamu po 32 B. Erase blok (W25Q sektor 4096 B) pojme presne
 * 128 zaznamu. Zapisuje se cistě dopredu; na hranici bloku se blok NEJDRIV smaze
 * (u NOR; u SD backendu erase_size==0 a krok odpada) a tim se zahodi 128
 * nejstarsich zaznamu -> kruh. Zadna metadata mimo zaznamy: pozice zapisu se po
 * bootu ODVODI ze seq cisel (viz find_head), takze log prezije reset i vypadek
 * napajeni bez zvlastni hlavicky.
 *
 * `seq` je monotonni pres cely region a zaroven slouzi jako priznak obsazenosti:
 * smazana flash = 0xFF -> seq == DATALOG_SEQ_EMPTY == volny slot.
 */
#include "datalog.h"
#include "w25q.h"
#include "w25q_map.h"
#include "freertos_shared.h"   /* g_sensors, g_rtc_text, g_spi_ok, qspiMutexHandle */
#include "fpga_freq.h"
#include "gps.h"
#include "cmsis_os2.h"
#include "stm32h7xx_hal.h"
#include <stdio.h>
#include <string.h>

/* Timeouty QSPI mutexu: tick bezi v defaultTask (krmi watchdog) -> pri obsazene
 * sbernici zapis radeji vynecha a zkusi za DATALOG_PERIOD_S znovu. Cteni/erase
 * z UI/UART smi cekat dele (erase sektoru az ~400 ms). */
#define DL_LOCK_TICK_MS   10u
#define DL_LOCK_READ_MS   500u
#define DL_LOCK_ERASE_MS  2000u

#define RECS_PER_BLOCK(b) ((b)->erase_size ? (b)->erase_size / DATALOG_REC_SIZE : 0u)

static const datalog_backend_t *s_be;
static bool     s_ready;
static bool     s_enabled = true;      /* prepisuje syscfg_load pres datalog_set_enabled */
static uint32_t s_head;                /* offset dalsiho zapisu [B] */
static uint32_t s_seq;                 /* seq posledniho zapsaneho (0 = zadny) */
static uint32_t s_count;               /* pocet platnych zaznamu (strop = capacity_rec) */
static uint32_t s_errors;
static bool     s_wrapped;
static uint32_t s_next_ms;             /* HAL_GetTick kdy vzorkovat priste */

/* ── Serializace zaznamu (LE, bez zavislosti na paddingu struktury) ────────── */

static uint16_t crc16(const uint8_t *d, uint32_t n)
{
    uint16_t c = 0xFFFF;                       /* CRC-16/CCITT-FALSE (jako w25q_store/FPGA) */
    for (uint32_t i = 0; i < n; i++) {
        c ^= (uint16_t)d[i] << 8;
        for (int b = 0; b < 8; b++)
            c = (c & 0x8000) ? (uint16_t)((c << 1) ^ 0x1021) : (uint16_t)(c << 1);
    }
    return c;
}

static void put_u16(uint8_t *p, uint16_t v) { p[0] = (uint8_t)v; p[1] = (uint8_t)(v >> 8); }
static void put_u32(uint8_t *p, uint32_t v)
{
    p[0] = (uint8_t)v;         p[1] = (uint8_t)(v >> 8);
    p[2] = (uint8_t)(v >> 16); p[3] = (uint8_t)(v >> 24);
}
static void put_u64(uint8_t *p, uint64_t v) { put_u32(p, (uint32_t)v); put_u32(p + 4, (uint32_t)(v >> 32)); }
static uint16_t get_u16(const uint8_t *p) { return (uint16_t)(p[0] | ((uint16_t)p[1] << 8)); }
static uint32_t get_u32(const uint8_t *p)
{
    return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}
static uint64_t get_u64(const uint8_t *p) { return (uint64_t)get_u32(p) | ((uint64_t)get_u32(p + 4) << 32); }

/* Rozvrzeni 32B zaznamu: 0 seq, 4 t_unix, 8 freq, 16 t_ocxo, 18 t_board,
 * 20 vc_mv, 22 rf_mv, 24 flags, 25 sats, 26 hdop10, 27 vbat (8 mV krok,
 * 0 = nezaznamenano), 28 CRC16 (bajty 0..27), 30 rezerva.
 * ⚠️ Bajt 27 byl do 2026-08-17 `spare` (vzdy 0) a je UVNITR CRC. Diky tomu, ze
 * je 0 vyhrazena jako "nezaznamenano", se stare zaznamy ctou dal spravne a
 * format zustava 32 B — zadna migrace ani verze zaznamu netreba. */
static uint8_t vbat_encode(int16_t mv)
{
    if (mv == DATALOG_INVALID16) return DATALOG_VBAT_NONE;
    int32_t code = ((int32_t)mv - DATALOG_VBAT_BASE_MV) / DATALOG_VBAT_STEP_MV;
    if (code < 1)   code = 1;     /* pod 2008 mV je CR2032 stejne mrtva; 0 = sentinel */
    if (code > 255) code = 255;
    return (uint8_t)code;
}

static int16_t vbat_decode(uint8_t code)
{
    if (code == DATALOG_VBAT_NONE) return DATALOG_INVALID16;
    return (int16_t)(DATALOG_VBAT_BASE_MV + (int32_t)code * DATALOG_VBAT_STEP_MV);
}

static void pack_rec(uint8_t *b, const datalog_rec_t *r)
{
    memset(b, 0, DATALOG_REC_SIZE);
    put_u32(b + 0, r->seq);
    put_u32(b + 4, r->t_unix);
    put_u64(b + 8, r->freq_x100000);
    put_u16(b + 16, (uint16_t)r->t_ocxo_c100);
    put_u16(b + 18, (uint16_t)r->t_board_c100);
    put_u16(b + 20, (uint16_t)r->ocxo_vc_mv);
    put_u16(b + 22, (uint16_t)r->rf_mv);
    b[24] = r->flags;
    b[25] = r->sats;
    b[26] = r->hdop10;
    b[27] = vbat_encode(r->vbat_mv);
    put_u16(b + 28, crc16(b, 28));
}

static bool unpack_rec(const uint8_t *b, datalog_rec_t *r)
{
    uint32_t seq = get_u32(b + 0);
    if (seq == DATALOG_SEQ_EMPTY || seq == 0) return false;    /* prazdny slot */
    if (crc16(b, 28) != get_u16(b + 28)) return false;         /* poskozeny zaznam */
    r->seq           = seq;
    r->t_unix        = get_u32(b + 4);
    r->freq_x100000  = get_u64(b + 8);
    r->t_ocxo_c100   = (int16_t)get_u16(b + 16);
    r->t_board_c100  = (int16_t)get_u16(b + 18);
    r->ocxo_vc_mv    = (int16_t)get_u16(b + 20);
    r->rf_mv      = (int16_t)get_u16(b + 22);
    r->flags         = b[24];
    r->sats          = b[25];
    r->hdop10        = b[26];
    r->vbat_mv       = vbat_decode(b[27]);   /* stare zaznamy: 0 -> DATALOG_INVALID16 */
    return true;
}

/* ── Cas: "YYYY-MM-DD HH:MM:SS" (g_rtc_text, UTC) -> unix ──────────────────
 * RTC pise defaultTask, datalog_tick bezi ve stejnem tasku -> retezec je
 * konzistentni bez zamku. Ciste kalendarni (dny od epochy), bez time.h. */
static uint32_t days_from_civil(int y, int m, int d)
{
    y -= (m <= 2);                                   /* rok zacina brezenem */
    int era = (y >= 0 ? y : y - 399) / 400;
    unsigned yoe = (unsigned)(y - era * 400);
    unsigned doy = (unsigned)((153 * (m + (m > 2 ? -3 : 9)) + 2) / 5 + d - 1);
    unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
    return (uint32_t)((int32_t)era * 146097 + (int32_t)doe - 719468);   /* 1970-01-01 = 0 */
}

/* Rucni parser misto sscanf (mensi kod, zadna libc scanf zavislost) — cte pevne
 * "YYYY-MM-DD HH:MM:SS" a hlida ze na pozicich cislic OPRAVDU jsou cislice. */
static bool rd_num(const char *s, int n, int *out)
{
    int v = 0;
    for (int i = 0; i < n; i++) {
        if (s[i] < '0' || s[i] > '9') return false;
        v = v * 10 + (s[i] - '0');
    }
    *out = v;
    return true;
}

