ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/datalog.c
static uint32_t datalog_text_to_unix(const char *s)
{
    int Y, M, D, h, mi, sec;
    if (s == NULL || strlen(s) < 19) return 0;
    if (s[4] != '-' || s[7] != '-' || s[13] != ':' || s[16] != ':') return 0;
    if (!rd_num(s, 4, &Y) || !rd_num(s + 5, 2, &M) || !rd_num(s + 8, 2, &D)) return 0;
    if (!rd_num(s + 11, 2, &h) || !rd_num(s + 14, 2, &mi) || !rd_num(s + 17, 2, &sec)) return 0;
    if (Y < 1970 || Y > 2199 || M < 1 || M > 12 || D < 1 || D > 31) return 0;
    if (h > 23 || mi > 59 || sec > 60) return 0;
    return days_from_civil(Y, M, D) * 86400u + (uint32_t)(h * 3600 + mi * 60 + sec);
}

/* Verejny prevod aktualniho RTC (UTC) na unix — stejne pravidlo jako v zaznamu
 * (0 = RTC nesynchronizovano z GPS). Cte `g_rtc_text`/`g_rtc_synced`, ktere pise
 * defaultTask; volat VYHRADNE z defaultTasku (ipc_publish), jinak retez neni
 * konzistentni. Slouzi hlavne k naplneni `rtc_unix` v IPC snapshotu (web/SCPI). */
uint32_t datalog_now_unix(void)
{
    return g_rtc_synced ? datalog_text_to_unix((const char *)g_rtc_text) : 0u;
}

/* ── W25Q backend ─────────────────────────────────────────────────────────── */

/* Probe = plny w25q_init(), NE jen JEDEC: bez initu neni zapnute 4-byte
 * adresovani (EN4B) a `w25q_read` nad 16 MB by cetl uplne jinam. Volani je
 * idempotentni — syscfg_load ho uz mozna udelal, opakovani jen znovu srovna cip
 * (bezi pod qspiMutexHandle, takze do toho nikdo jiny nesahne). */
static bool w25q_be_probe(void) { return w25q_init(); }
static bool w25q_be_read(uint32_t off, uint8_t *buf, uint32_t len)
{
    return w25q_read(W25Q_DATA_BASE + off, buf, len);
}
static bool w25q_be_write(uint32_t off, const uint8_t *buf, uint32_t len)
{
    return w25q_write(W25Q_DATA_BASE + off, buf, len);
}
static bool w25q_be_erase(uint32_t off)
{
    return w25q_erase_sector(W25Q_DATA_BASE + off);
}

const datalog_backend_t datalog_backend_w25q = {
    .name = "W25Q", .probe = w25q_be_probe, .read = w25q_be_read,
    .write = w25q_be_write, .erase = w25q_be_erase,
    .erase_size = W25Q_SECTOR_SIZE, .capacity = W25Q_DATALOG_SIZE,  /* jen 1/3 DATA regionu, viz w25q_map.h */
};

/* ── Hledani pozice zapisu po bootu ───────────────────────────────────────────
 * Blok, ktery ma v PRVNIM zaznamu nejvyssi seq, je nejnovejsi (seq roste
 * monotonne pres cely region). V nem se pak linearne najde prvni volny slot.
 * Cte CELY 32B zaznam na blok a overuje jeho CRC (2026-08-16; drive jen 4 B se
 * seq, coz propustilo garbage — viz komentar ve skenu). Pri 5445 blocich
 * (1/3 DATA regionu) je to ~174 kB, ~38 ms @ 4,6 MB/s. Zbytecne to neroste:
 * QSPI cteni je stropovane pollingem FIFO, ne velikosti bloku.
 * ⚠️ Pro SD backend (erase_size == 0) je "blok" cely region a vnitrni scan by
 * byl linearni pres miliony zaznamu -> az bude SD ziva, nahradit BINARNIM
 * hledanim hranice seq (log je monotonni, takze binarni scan je primocary). */
static void find_head(void)
{
    uint32_t nblk = s_be->erase_size ? s_be->capacity / s_be->erase_size : 1u;
    uint32_t rpb  = RECS_PER_BLOCK(s_be);
    if (rpb == 0) rpb = s_be->capacity / DATALOG_REC_SIZE;   /* SD: jeden "blok" = cely region */

    uint32_t best_blk = 0, best_seq = 0;
    uint32_t blk_with_data = 0;         /* kolik bloku ma platny prvni zaznam (viz wrap nize) */
    bool found = false;
    for (uint32_t i = 0; i < nblk; i++) {
        /* ⚠️ Cte se CELY 32B zaznam a overuje se CRC (`unpack_rec`), ne jen 4 bajty
         * seq jako driv. Bez te kontroly prosel jako platny i GARBAGE z flash —
         * a protoze se bere blok s NEJVYSSIM seq, staci jediny poskozeny bajt,
         * aby si datalog myslel, ze hlava je uplne jinde. Presne to nastalo po
         * zmene kapacity regionu 2026-08-15: `seq` vyslo 3823341906 (~1,2 mld let
         * pri 10 s/zaznam) a stav logu byl cely mimo. */
        uint8_t b[DATALOG_REC_SIZE];
        datalog_rec_t probe;
        if (!s_be->read(i * s_be->erase_size, b, DATALOG_REC_SIZE)) continue;
        if (!unpack_rec(b, &probe)) continue;    /* prazdny NEBO poskozeny -> preskoc */
        uint32_t seq = probe.seq;
        blk_with_data++;
        if (!found || seq > best_seq) { found = true; best_seq = seq; best_blk = i; }
        /* ⚠️ Sken je 16352 QSPI transakci (cely DATA region po 4 KB blocich) a
         * `w25q_read` uvnitr POLLUJE FIFO bez yieldu. Bez tohoto ustoupeni by
         * defaultTask drzel CPU v kuse — a protoze prave defaultTask obnovuje
         * IWDG (watchdog_supervise), byl by dost dlouhy sken WATCHDOG RESET
         * (boot grace je jen 8 s). Yield po kazdych 512 blocich pusti ke slovu
         * UiTask/FpgaTask (heartbeaty) i zbytek smycky defaultTask. */
        if ((i & 511u) == 511u) osDelay(1);
    }

    if (!found) {                       /* prazdne uloziste */
        s_head = 0; s_seq = 0; s_count = 0; s_wrapped = false;
        return;
    }

    /* Prvni volny slot v nejnovejsim bloku.
     * ⚠️ Stejna CRC kontrola jako vyse (unpack_rec), NE jen syrovy `seq` — bez ni
     * tenhle vnitrni scan verí garbage stejne, jako to do 2026-08-16 delal vnejsi
     * (viz komentar u nej). Overeno na HW pres sondu 2026-08-17 PO fixu vnejsiho
     * scanu: `s_count` uz vyslo spravne (47043), ale `s_seq` byl 3823345955 —
     * temer identicka hodnota jako historicka garbage 3823341906 zminovana vyse
     * (stary obsah flash zpred zmenseni regionu 2026-08-15, ktery neni cisty 0xFF,
     * ale ani platny zaznam). Poskozeny/neplatny slot se ted bere jako HRANICE
     * hlavy stejne jako prazdny — dalsi realny zapis ho proste prepise spravnymi
     * daty (samo-opravne), takze zadne zvlastni osetreni netreba. */
    uint32_t base = best_blk * s_be->erase_size;
    uint32_t used = rpb;                /* default: blok je plny */
    uint32_t last = best_seq;
    for (uint32_t k = 0; k < rpb; k++) {
        uint8_t b[DATALOG_REC_SIZE];
        datalog_rec_t probe;
        if (!s_be->read(base + k * DATALOG_REC_SIZE, b, DATALOG_REC_SIZE)) { used = k; break; }
        if (!unpack_rec(b, &probe)) { used = k; break; }   /* prazdny NEBO poskozeny -> hranice */
        last = probe.seq;
    }
    s_seq  = last;
    s_head = base + used * DATALOG_REC_SIZE;
    if (s_head >= s_be->capacity) s_head = 0;

    /* ⚠️ Kolik zaznamu v logu JE, se pozna ze STAVU FLASH — ne z absolutni hodnoty
     * `seq`. Driv tu stalo `s_wrapped = (s_seq > cap_rec)`, coz mlcky predpoklada,
     * ze log zacal na seq=1 a od te doby se nezmenila kapacita ani se nic nesmazalo.
     * Po zmensení regionu na 1/3 (2026-08-15) to hlasilo PLNY log (696960 zaznamu),
     * zatimco realne jich bylo 42989 — export pak zbytecne prosel 653k prazdnych
     * slotu. `seq` navic po dostatecne dlouhem behu pretece, takze na nem pocet
     * zaznamu stavet nelze vubec.
     *
     * Pocitame z toho, kolik BLOKU ma platna data: bloky se plni sekvencne, takze
     * (pocet plnych bloku - 1) * rpb + zaznamy v bloku s hlavou. Kruh povazujeme
     * za obehnuty, kdyz maji data uz vsechny bloky krome jednoho — pri wrapu se
     * totiz nejstarsi blok prave smazal, takze prazdny zustava. */
    uint32_t cap_rec = s_be->capacity / DATALOG_REC_SIZE;
    s_wrapped = (nblk > 1u) && (blk_with_data >= nblk - 1u);
    if (s_wrapped) {
        s_count = cap_rec;
    } else {
        uint32_t c = (blk_with_data ? (blk_with_data - 1u) * rpb : 0u) + used;
        s_count = (c > cap_rec) ? cap_rec : c;
    }
}

void datalog_init(void)
{
    s_be = NULL; s_ready = false;

    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_READ_MS) != osOK) return;
    /* SD ma prednost (vetsi, vyjimatelna); dokud neni osazena, probe() = false. */
    if (datalog_backend_sd.probe && datalog_backend_sd.probe())      s_be = &datalog_backend_sd;
    else if (datalog_backend_w25q.probe())                           s_be = &datalog_backend_w25q;
    /* Kapacita 0 by v write_rec/read_back znamenala deleni nulou -> backend s
     * nesmyslnou kapacitou radeji odmitnout (napr. nedokoncena SD implementace). */
    if (s_be != NULL && s_be->capacity < DATALOG_REC_SIZE) s_be = NULL;
    if (s_be != NULL) { find_head(); s_ready = true; }
    osMutexRelease(qspiMutexHandle);

    s_next_ms = HAL_GetTick() + DATALOG_PERIOD_S * 1000u;
    printf("datalog: %s %s (%lu zazn., seq %lu)\n",
           s_ready ? s_be->name : "--", s_ready ? "ready" : "NEDOSTUPNE",
           (unsigned long)s_count, (unsigned long)s_seq);
}

/* ── Sber jednoho vzorku ze zivych globalu ─────────────────────────────────── */

