ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/datalog.c
static int16_t sens_c100(sensor_id_t id)
{
    const sensor_stat_t *s = &g_sensors[id];
    if (!s->valid || s->samples == 0) return DATALOG_INVALID16;
    float v = s->last * 100.0f;
    if (v > 32000.0f || v < -32000.0f) return DATALOG_INVALID16;
    return (int16_t)(v < 0 ? v - 0.5f : v + 0.5f);
}

static int16_t sens_mv(sensor_id_t id)
{
    const sensor_stat_t *s = &g_sensors[id];
    if (!s->valid || s->samples == 0) return DATALOG_INVALID16;
    float v = s->last;
    if (v > 32000.0f || v < -32000.0f) return DATALOG_INVALID16;
    return (int16_t)(v + 0.5f);
}

static void sample(datalog_rec_t *r)
{
    memset(r, 0, sizeof *r);

    fpga_meas_t m;
    int use16 = 0;
    if (fpga_freq_get_last(&m)) {
        /* fpga_freq_select() ma vnitrni stav a smi ji volat JEN FpgaTask ->
         * tady jen precteme, ktera odbocka ma platna data (bez hystereze). */
        use16 = (m.error_flags & FPGA_ERR_MEAS) && !(m.status2 & FPGA_ST2_DIV16_ERR);
        r->freq_x100000 = use16 ? m.freq16_x100000 : m.frequency_x100000;
    }

    r->t_unix       = g_rtc_synced ? datalog_text_to_unix((const char *)g_rtc_text) : 0u;
    r->t_ocxo_c100  = sens_c100(SENS_T49);    /* OCXO */
    r->t_board_c100 = sens_c100(SENS_T48);    /* STM deska */
    r->ocxo_vc_mv   = sens_mv(SENS_ADS0);     /* ladici napeti */
    /* RF: ADS AIN1 je mV z AD8307; prevod na dBm dela UI (kalibrace g_calib).
     * Do logu jde SYROVE mV — kalibrace se muze zmenit, syrova hodnota ne. */
    r->rf_mv     = sens_mv(SENS_ADS1);
    r->vbat_mv      = sens_mv(SENS_VBAT);     /* zalozni CR2032 — trend stárnutí */

    gps_data_t g;
    gps_get(&g);
    uint8_t f = 0;
    if (g.valid)                                f |= DATALOG_F_GPS_VALID;
    if (g.fix_mode >= 3)                        f |= DATALOG_F_FIX_3D;
    if (g_spi_ok)                               f |= DATALOG_F_FPGA_LINK;
    if (g_freq_stale)                           f |= DATALOG_F_SIGNAL_LOST;
    if (use16)                                  f |= DATALOG_F_DIV16;
    if (!g.valid && g.fixes > 0)                f |= DATALOG_F_HOLDOVER;
    if (fpga_sim_active())                      f |= DATALOG_F_SIM;   /* emulovany kmitocet */
    r->flags  = f;
    r->sats   = g.num_sat;
    r->hdop10 = (g.hdop > 0.0f && g.hdop < 25.0f) ? (uint8_t)(g.hdop * 10.0f + 0.5f) : 255u;
}

/* Zapise zaznam na s_head (vc. erase na hranici bloku). Ocekava drzeny mutex. */
static bool write_rec(const datalog_rec_t *r)
{
    if (s_be->erase_size && (s_head % s_be->erase_size) == 0) {
        /* Novy blok -> smazat (zahodi 128 nejstarsich zaznamu = kruh). */
        if (s_be->erase == NULL || !s_be->erase(s_head)) return false;
        if (s_head == 0 && s_seq != 0) s_wrapped = true;   /* obeh dokola */
    }
    uint8_t b[DATALOG_REC_SIZE];
    pack_rec(b, r);
    if (!s_be->write(s_head, b, DATALOG_REC_SIZE)) return false;

    s_head = (s_head + DATALOG_REC_SIZE) % s_be->capacity;
    s_seq  = r->seq;
    uint32_t cap_rec = s_be->capacity / DATALOG_REC_SIZE;
    if (s_count < cap_rec) s_count++;
    return true;
}

void datalog_tick(void)
{
    if (!s_ready || !s_enabled) return;
    if ((int32_t)(HAL_GetTick() - s_next_ms) < 0) return;
    s_next_ms += DATALOG_PERIOD_S * 1000u;

    datalog_rec_t r;
    sample(&r);
    r.seq = s_seq + 1u;

    /* Kratky timeout: pri obsazene flash (calib_save / syscfg / UART qspitest)
     * vzorek zahodime a jedeme dal — defaultTask nesmi zdrzet watchdog. */
    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_TICK_MS) != osOK) { s_errors++; return; }
    bool ok = write_rec(&r);
    osMutexRelease(qspiMutexHandle);
    if (!ok) s_errors++;
}

void datalog_set_enabled(bool en) { s_enabled = en; }
bool datalog_enabled(void)         { return s_enabled; }

void datalog_get_status(datalog_status_t *out)
{
    if (out == NULL) return;
    out->backend      = s_ready ? s_be->name : "--";
    out->ready        = s_ready;
    out->enabled      = s_enabled;
    out->records      = s_count;
    out->capacity_rec = s_ready ? s_be->capacity / DATALOG_REC_SIZE : 0u;
    out->last_seq     = s_seq;
    out->write_errors = s_errors;
    out->wrapped      = s_wrapped;
}

bool datalog_read_back(uint32_t from_newest, datalog_rec_t *out)
{
    if (!s_ready || out == NULL || from_newest >= s_count) return false;
    /* s_head ukazuje ZA posledni zapsany -> zpet o (from_newest+1) zaznamu. */
    uint32_t back = (from_newest + 1u) * DATALOG_REC_SIZE;
    uint32_t off  = (s_head + s_be->capacity - (back % s_be->capacity)) % s_be->capacity;

    uint8_t b[DATALOG_REC_SIZE];
    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_READ_MS) != osOK) return false;
    bool ok = s_be->read(off, b, DATALOG_REC_SIZE);
    osMutexRelease(qspiMutexHandle);
    return ok && unpack_rec(b, out);
}

/* ── Bulk cteni (STATUS #142) ─────────────────────────────────────────────────
 * `datalog_read_back` plati na KAZDY 32B zaznam vlastni mutex i vlastni QSPI
 * prikaz (instrukce + 4B adresa + 8 dummy). Zmereno: ~173 us/zaznam, zatimco
 * samotnych 32 B je pri 4,6 MB/s jen ~7 us -> **rezie je 25x vetsi nez prenos**,
 * takze pruchod desitkami tisic zaznamu (okna GRAFY / KVALITA GPS / ANALYZA,
 * `datalog csv`, rekonstrukce Allanovy pyramidy) trval jednotky az desitky sekund.
 *
 * 🔑 Zaznamy davky lezi v ringu SOUVISLE: `from_newest+1` je o 32 B NIZ nez
 * `from_newest`, takze n zaznamu = jeden blok `n*32 B`. Staci ho precist najednou
 * (pripadne ve dvou kusech, kdyz prelezl pres konec ringu) a rozbalit pozpatku.
 *
 * ⚠️ Scratch je `static` — 2 kB na stack malych tasku nepatri (viz CLAUDE.md).
 * Proto je funkce chranena TIMTEZ mutexem jako cely prenos: dva soubezni ctenari
 * by si scratch prepsali. */
static uint8_t s_bulk[DATALOG_BULK_MAX * DATALOG_REC_SIZE];

uint32_t datalog_read_bulk(uint32_t from_newest, datalog_rec_t *out,
                           uint32_t max_n, uint32_t *consumed)
{
    if (consumed) *consumed = 0;
    if (!s_ready || out == NULL || max_n == 0u || from_newest >= s_count) return 0;

    uint32_t n = max_n;
    if (n > s_count - from_newest) n = s_count - from_newest;   /* nekoukat za nejstarsi */
    if (n > DATALOG_BULK_MAX)      n = DATALOG_BULK_MAX;
    if (n == 0u) return 0;

    const uint32_t cap = s_be->capacity;
    const uint32_t len = n * DATALOG_REC_SIZE;
    /* Zacatek bloku = pozice NEJSTARSIHO zaznamu davky (`from_newest + n - 1`),
     * tedy o (from_newest + n) zaznamu zpet od hlavy. */
    const uint32_t back  = (from_newest + n) * DATALOG_REC_SIZE;
    const uint32_t start = (s_head + cap - (back % cap)) % cap;

    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_READ_MS) != osOK) return 0;
    bool ok;
    if (start + len <= cap) {
        ok = s_be->read(start, s_bulk, len);                    /* jeden kus */
    } else {                                                    /* preteklo pres konec ringu */
        uint32_t first = cap - start;
        ok = s_be->read(start, s_bulk, first)
          && s_be->read(0u, s_bulk + first, len - first);
    }
    osMutexRelease(qspiMutexHandle);
    if (!ok) return 0;

    /* V bufferu je nejstarsi zaznam PRVNI, volajici ceka nejnovejsi prvni. */
    uint32_t got = 0;
    for (uint32_t i = 0; i < n; i++) {
        const uint8_t *p = &s_bulk[(n - 1u - i) * DATALOG_REC_SIZE];
        if (unpack_rec(p, &out[got])) got++;   /* poskozeny/prazdny -> preskoc (jako `continue`) */
    }
    if (consumed) *consumed = n;               /* pokryte POZICE, vc. preskocenych */
    return got;
}

void datalog_format_status(char *buf, int buflen)
{
    if (buf == NULL || buflen <= 0) return;
    if (!s_ready) { snprintf(buf, (size_t)buflen, "DATALOG NEDOSTUPNE (uloziste)"); return; }
    snprintf(buf, (size_t)buflen, "DATALOG %s %s %lu/%lu rec seq:%lu err:%lu%s",
             s_be->name, s_enabled ? "ON" : "OFF",
             (unsigned long)s_count, (unsigned long)(s_be->capacity / DATALOG_REC_SIZE),
             (unsigned long)s_seq, (unsigned long)s_errors, s_wrapped ? " WRAP" : "");
}

bool datalog_erase_all(void)
{
    if (!s_ready) return false;
    if (osMutexAcquire(qspiMutexHandle, DL_LOCK_ERASE_MS) != osOK) return false;
    bool ok = true;
    if (s_be->erase_size && s_be->erase) {
        for (uint32_t off = 0; off < s_be->capacity; off += s_be->erase_size) {
            if (!s_be->erase(off)) { ok = false; break; }
        }
    }
    if (ok) { s_head = 0; s_seq = 0; s_count = 0; s_wrapped = false; s_errors = 0; }
    osMutexRelease(qspiMutexHandle);
    return ok;
}

