ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/datalog.c
volatile uint8_t g_datalog_erase_req  = 0;
volatile uint8_t g_datalog_erase_busy = 0;

void datalog_erase_service(void)
{
    if (!g_datalog_erase_req) return;
    /* ⚠️ `g_datalog_erase_req` se NULUJE AZ PO dokonceni (ne pred zacatkem).
     * Erase celeho regionu trva az minuty a UI po tu dobu vidi priznak porad
     * nastaveny -> jeho `if (!g_datalog_erase_req)` guard funguje jako dedup a
     * druhe projiti potvrzovaci sekvenci uz dalsi (zbytecny) erase nezaradi.
     * Kdyby se priznak shodil hned, slo by behem jednoho mazani zaradit dalsi. */
    g_datalog_erase_busy = 1;    /* UI to ukaze v radku Stav — jinak vypada zaseknute */
    printf("DATALOG: mazu cely log (z UI), cekej...\n");
    printf("DATALOG: erase %s\n", datalog_erase_all() ? "OK" : "FAIL");
    g_datalog_erase_busy = 0;
    g_datalog_erase_req  = 0;
}

/* ── Selftest (pure logic, bez HW — soucast UART "selftest") ───────────────── */
bool datalog_selftest(void)
{
    /* 1) round-trip serializace vcetne zapornych teplot a plneho u64 kmitoctu */
    datalog_rec_t a = {
        .seq = 0x01020304u, .t_unix = 1782000000u,
        .freq_x100000 = 1000000012345ull,
        .t_ocxo_c100 = -1234, .t_board_c100 = 4567,
        .ocxo_vc_mv = 2500, .rf_mv = -455,
        .flags = DATALOG_F_GPS_VALID | DATALOG_F_DIV16, .sats = 9, .hdop10 = 12,
        .vbat_mv = 2920,
    };
    uint8_t b[DATALOG_REC_SIZE];
    datalog_rec_t r;
    pack_rec(b, &a);
    if (!unpack_rec(b, &r)) return false;
    if (r.seq != a.seq || r.t_unix != a.t_unix || r.freq_x100000 != a.freq_x100000) return false;
    if (r.t_ocxo_c100 != a.t_ocxo_c100 || r.t_board_c100 != a.t_board_c100) return false;
    if (r.ocxo_vc_mv != a.ocxo_vc_mv || r.rf_mv != a.rf_mv) return false;
    if (r.flags != a.flags || r.sats != a.sats || r.hdop10 != a.hdop10) return false;
    /* VBAT je kvantovany na 8 mV, takze round-trip NENI presny — 2920 sedne
     * na 2920 (2920-2000=920, 920/8=115 -> 2000+115*8), ale obecne se testuje
     * jen to, ze se hodnota vejde do kroku. */
    if (r.vbat_mv < a.vbat_mv - DATALOG_VBAT_STEP_MV ||
        r.vbat_mv > a.vbat_mv + DATALOG_VBAT_STEP_MV) return false;
    /* ⚠️ Zpetna kompatibilita: STARY zaznam ma bajt 27 = 0 a MUSI se precist jako
     * "nezaznamenano", ne jako mrtva baterie 2,00 V. Sestavime takovy zaznam
     * rucne (vcetne prepocteneho CRC) a overime. */
    {   uint8_t old[DATALOG_REC_SIZE];
        datalog_rec_t o;
        pack_rec(old, &a);
        old[27] = 0u;                       /* jako by ho zapsal firmware pred 2026-08-17 */
        put_u16(old + 28, crc16(old, 28));  /* CRC bajt 27 pokryva -> prepocitat */
        if (!unpack_rec(old, &o)) return false;
        if (o.vbat_mv != DATALOG_INVALID16) return false;
    }
    /* Neplatne cteni senzoru se ulozi jako "nezaznamenano". */
    {   datalog_rec_t n = a; n.vbat_mv = DATALOG_INVALID16;
        uint8_t nb[DATALOG_REC_SIZE]; datalog_rec_t nr;
        pack_rec(nb, &n);
        if (nb[27] != DATALOG_VBAT_NONE) return false;
        if (!unpack_rec(nb, &nr) || nr.vbat_mv != DATALOG_INVALID16) return false;
    }

    /* 2) poskozeny bajt musi CRC odhalit */
    b[10] ^= 0xFFu;
    if (unpack_rec(b, &r)) return false;

    /* 3) prazdny (smazana flash) slot neni zaznam */
    memset(b, 0xFF, sizeof b);
    if (unpack_rec(b, &r)) return false;

    /* 4) kalendar -> unix (vektory: epocha, prestupny rok, znamy datum) */
    if (datalog_text_to_unix("1970-01-01 00:00:00") != 0u) return false;
    if (datalog_text_to_unix("2000-03-01 00:00:00") != 951868800u) return false;
    if (datalog_text_to_unix("2026-07-20 12:34:56") != 1784550896u) return false;
    if (datalog_text_to_unix("nesmysl") != 0u) return false;

    /* 5) SD backend: 512B read-modify-write layer (SD zatím neaktivní, jen logika) */
    if (!datalog_sd_selftest()) return false;
    return true;
}
